const sutra = {
  preSutra:
    "अथ स्यात् न चेतनगतं मुख्यमीक्षणमिहोच्यते, अपि तु प्रधानगतं गौणमीक्षणम् 'तत्तेज ऐक्षतता आप ऐक्षन्त' इति गौणेक्षणसाहचर्यात् । भवति चाचेतनेष्वपि चेतनधर्मोपचारः । यथा 'वृष्टिप्रतीक्षाः शालयः' 'वर्षेण बीजं प्रतिसञ्जहर्ष' इति । अतो गौणमीक्षणमितीमामाशङ्कामनुभाष्य प्रतिहरति –",
  sutra: "गौणश्चेन्नात्नशब्दात् ॥१-१-६॥",
  number: 2,
  devanagari_commentary:
    "यदुक्तम्- गौणेक्षणसाहचर्यात् सतोऽपीक्षणव्यपदेशः सगर्नियतपूर्वावस्थाभिप्रायो गौण इति । तन्न 'ऐतदात्म्यमिदं सर्वं तत्सत्यं स आत्मा' इति सच्छब्दप्रतिपादितस्य आत्मशब्देन व्यपदेशात् । एतदुक्तं भवति 'ऐतदात्म्यमिदं सर्वम् स आत्मा' इति चेतनाचेतनप्रपञ्चोद्देशेन सत आत्मत्वोपदेशोऽयं नाचेतने प्रधाने सङ्गच्छत इति, अतस्तेजोबन्नानामपि परमात्मैवात्मति तेजःप्रभृतयोऽपि शब्दाः परमात्मन एव वाचकाः । तथा हि 'हन्ताऽहमिमास्तिस्रो देवता अनेन जीवेनात्मनाऽनुप्रविश्य नामरूपे व्याकरणानि' इति परमात्मानुप्रवेशादेव\n\nतेजःप्रभृतीनां वस्तुत्वं तत्तन्नामभाक्तवं चेति 'तत्तेज ऐक्षतता आप ऐक्षन्त' इत्यपि मुख्य एवेक्षणव्यपदेशः, अतः साहचर्यादपि 'तदैक्षत' इत्यत्र गौणत्वाशङ्का दूरोत्सारितेति सूत्राभिप्रायः ।। इतश्च न प्रधानं सच्छब्दप्रतिपाद्यम् ।\n\nतेजःप्रभृतीनां वस्तुत्वं तत्तन्नामभाक्तवं चेति 'तत्तेज ऐक्षतता आप ऐक्षन्त' इत्यपि मुख्य एवेक्षणव्यपदेशः, अतः साहचर्यादपि 'तदैक्षत' इत्यत्र गौणत्वाशङ्का दूरोत्सारितेति सूत्राभिप्रायः ।।",
}

export default function SutraInfo() {
  return (
    <div className="bg-secondary font-semibold p-4 [&>*]:p-4 rounded-md h-[300px] overflow-y-scroll overflow-x-auto shadow-md">
      <p>{sutra.preSutra}</p>
      <h2 className="text-center font-bold text-2xl text-red-500">
        {sutra.sutra}
      </h2>
      <p>{sutra.devanagari_commentary}</p>
    </div>
  )
}
