interface Transliteration {
  kannada: {
    preSutra: string
    sutra: string
    text: string
  }
  roman: {
    preSutra: string
    sutra: string
    text: string
  }
  telugu: {
    preSutra: string
    sutra: string
    text: string
  }
  tamil: {
    preSutra: string
    sutra: string
    text: string
  }
  number: number
}

export const transliterationSelector = (sutraNo: number) => {
  return transliterations.find(
    (transliteration) => transliteration.number === sutraNo
  )
}

const transliterations: Transliteration[] = [
  {
    kannada: {
      preSutra: "",
      sutra: "ಈಕ್ಷತೇರ್ನಾಶಬ್ದಮ್ || ೧-೧-೫||",
      text: "ಯತೋ ವಾ ಇಮಾನಿ' (ತೈ.ಉ.ಭೃ್೧) ಇತ್ಯಾದಿ ಜಗತ್ಕಾರಣವಾದಿವಾಕ್ಯ ಪ್ರತಿಪಾದ್ಯಂ ಸರ್ವಜ್ಞಂ ಸರ್ವಶಕ್ತಿ ಸಮಸ್ತಹೇಯಪ್ರತ್ಯನೀಕಕಲ್ಯಾಣಗುಣೈಕತಾನಂ ಬ್ರಹ್ಮ, ಜಿಜ್ಞಾಸ್ಯಮ್-ಇತ್ಯುಕ್ತಮ್। ಇದಾನೀಂ ಜಗತ್ಕಾರಣವಾದಿವಾಕ್ಯಾನಾಮ್ ಆನುಮಾನಿಕಪ್ರಧಾನಾದಿಪ್ರತಿಪಾದನಾನರ್ಹತಾ ಉಚ್ಯತೇ 'ಈಕ್ಷತೇರ್ನಾಶಬ್ದಮ್' ಇತ್ಯಾದಿನಾ ||\n ಇದಮಾಮ್ನಾಯತೇ ಛಾನ್ದೋಗ್ಯೇ - 'ಸದೇವ ಸೋಮ್ಯೇದಮಗ್ರ ಆಸೀದೇಕಮೇವಾದ್ವಿತೀಯಮ್' (ಛಾಂ.ಉ. ೬-೨-೧) 'ತದೈಕ್ಷತ ಬಹು ಸ್ಯಾಂಪ್ರಜಾಯೇಯೇತಿ, ತತ್ತೇಜೋsಸೃಜತ' (ಛಾಂ.ಉ. ೬-೨-೩) ಇತ್ಯಾದಿ ||\n\n ತತ್ರ ಸಂದೇಹಃ - ಕಿಂ ಸಚ್ಛಬ್ದವಾಚ್ಯಂ ಜಗತ್ಕಾರಣಂ, ಪರೋಕ್ತಮ್ ಆನುಮಾನಿಕಂ ಪ್ರಧಾನಮ್? ಉತ ಉಕ್ತಲಕ್ಷಣಂ ಬ್ರಹ್ಮ? – ಇತಿ। ಕಿಂ ಪ್ರಾಪ್ತಮ್? ಪ್ರಧಾನಮ್ ಇತಿ। ಕುತಃ? 'ಸದೇವ ಸೋಮ್ಯೇದಮಗ್ರ ಆಸೀದೇಕಮೇವಾದ್ವಿತೀಯಂ' (ಛಾಂ.ಉ.೬-೨-೧) ಇತಿ 'ಇದಂ' ಶಬ್ದವಾಚ್ಯಸ್ಯ ಚೇತನಭೋಗ್ಯಭೂತಸ್ಯ ಸತ್ತ್ವರಜಸ್ತಮೋಮಯಸ್ಯ ವಿಯದಾದಿನಾನಾರೂಪವಿಕಾರಾವಸ್ಥಸ್ಯ ವಸ್ತುನಃ ಕಾರಣಾವಸ್ಥಾಂ ವದತಿ। ಕಾರಣಭೂತದ್ರವ್ಯಸ್ಯ ಅವಸ್ಥಾನ್ತರಾಪತ್ತಿರೇವ ಹಿ! ಕಾರ್ಯತಾ। ಅತಃ 'ಯದ್ರವ್ಯಂಯತ್ಸ್ವಭಾವಂ ಚ ಕಾರ್ಯಾವಸ್ಥಮ್, ತತ್ಸ್ವಭಾವಂ ತದೇವ ದ್ರವ್ಯಂ ಕಾರಣಾವಸ್ಥಮ್; ಸತ್ವಾದಿಮಯಂ ಚ ಕಾರ್ಯಮಿತಿ, ಗುಣಸಾಮ್ಯಾವಸ್ಥಂ ಪ್ರಧಾನಮೇವ ಹಿ ಕಾರಣಮ್; ತದೇವ ಉಪಸಂಹೃತಸಕಲವಿಶೇಷಂ ಸನ್ಮಾತ್ರಮಿತಿ, 'ಸದೇವ ಸೋಮ್ಯೇದಮಗ್ರ ಆಸೀದೇಕಮೇವಾದ್ವಿತೀಯಮ್' (ಛಾಂ.ಉ.೬-೨-೧) ಇತ್ಯಭಿಧೀಯತೇ। ತತ ಏವ ಚ, ಕಾರ್ಯ-ಕಾರಣಯೋಃ ಅನನ್ಯತ್ವಮ್ | ತಥಾ ಸತ್ಯೇವ, ಏಕವಿಜ್ಞಾನೇನಸರ್ವವಿಜ್ಞಾನಪ್ರತಿಜ್ಞೋಪಪತ್ತಿ: ಅನ್ಯಥಾ, ಯಥಾ ಸೋಮ್ಯೈಕೇನ ಮೃತ್ಪಿಂಡೇನ' (ಛಾಂ.ಉ.೬-೧-೪) ಇತ್ಯಾದಿಮೃತ್ಪಿಂಡತತ್ಕಾರ್ಯದೃಷ್ಟಾನ್ತದಾರ್ಷ್ಟಾನ್ತಿಕಯೋಃ ವೈರೂಪ್ಯಂ ಚೇತಿ, ಜಗತ್ಕಾರಣವಾದಿವಾಕ್ಯೇನ, ಮಹರ್ಷಿಣಾ ಕಪಿಲೇನೋಕ್ತಂ ಪ್ರಧಾನಮೇವ ಪ್ರತಿಪಾದ್ಯತೇ। ಪ್ರತಿಜ್ಞಾ-ದೃಷ್ಟಾನ್ತರೂಪೇಣ ಅನುಮಾನವೇಷಮೇವ ಚ ಇದಂ ವಾಕ್ಯಮಿತಿ, ಸಚ್ಛಬ್ದವಾಚ್ಯಮ್ ಆನುಮಾನಿಕಮೇವ ।।\n\n ಇತ್ಯೇವಂ ಪ್ರಾಪ್ತೇ, ಅಭಿಧೀಯತೇ - ಈಕ್ಷತೇರ್ನಾಶಬ್ದಮ್ - ಇತಿ । ಯಸ್ಮಿನ್ ಶಬ್ದ ಏವ ಪ್ರಮಾಣಂ ನ ಭವತಿ ತತ್ ಅಶಬ್ದಮ್ –ಆನುಮಾನಿಕಮ್; ಪ್ರಾಧಾನಮಿತ್ಯರ್ಥ। ನ ತತ್ ಜಗತ್ಕಾರಣವಾದಿವಾಕ್ಯಪ್ರತಿಪಾದ್ಯಮ್। ಕುತಃ? ಈಕ್ಷತೇ: - ಸಚ್ಛಬ್ದವಾಚ್ಯಸಂಬನ್ಧಿವ್ಯಾಪಾರ- ವಿಶೇಷಾಭಿಧಾಯಿನಃ ಈಕ್ಷತೇರ್ಧಾತೋಃ ಶ್ರವಣಾತ್ - 'ತದೈಕ್ಷತ ಬಹು ಸ್ಮಾಂ ಪ್ರಜಾಯೇಯ' (ಛಾಂ.ಉ.೬-೨-೩) ಇತಿ।ಈಕ್ಷಣಕ್ರಿಯಾಯೋಗಶ್ಚ ಅಚೇತನೇ ಪ್ರಧಾನೇ ನ ಸಮ್ಭವತಿ। ಅತಃ ಈದೃಶೇಕ್ಷಣಕ್ಷಮಃ ಚೇತನವಿಶೇಷಃ ಸರ್ವಜ್ಞಃ ಸರ್ವಶಕ್ತಿಃ ಪುರುಷೋತ್ತಮಃ ಸಚ್ಛಬ್ದಾಭಿಧೇಯಃ। ತಥಾ 'ಚ ಸರ್ವೆಷ್ವೇವ ಸೃಷ್ಟಿಪ್ರಕರಣೇಷು ಈಕ್ಷಾಪೂರ್ವಿಕೈವ ಸೃಷ್ಟಿ: ಪ್ರತೀಯತೇ - 'ಸ ಈಕ್ಷತ ಲೋಕಾನ್ನು ಸೃಜಾ ಇತಿ' (ಐತ.ಉ.೧-೧) 'ಸ ಇಮಾಂಲ್ಲೋಕಾನಸೃಜತ' (ಐತ.ಉ.೧-೨) 'ಸ ಈಕ್ಷಾಞ್ಚಕ್ರೇ' (ಪ್ರಶ್ನೆ.ಉ.೬-೩) 'ಸ ಪ್ರಾಣಮಸೃಜತ' (ಪ್ರಶ್ನೆ.ಉ.೬-೪) ಇತ್ಯಾದಿಷು ।।\n\n ನನು ಚ - ಕಾರ್ಯಾನುಗುಣೇನೈವ ಕಾರಣೇನ ಭವಿತವ್ಯಮ್? ಸತ್ಯಮ್; ಸರ್ವಕಾರ್ಯಾನುಗುಣ ಏವ ಸರ್ವಜ್ಞಃ ಸರ್ವಶಕ್ತಿ ಸತ್ಯಸಙ್ಕಲ್ಪ: ಪುರುಷೋತ್ತಮಃ ಸೂಕ್ಷ್ಮಚಿದಚಿದ್ವಸ್ತುಶರೀರಕಃ। ಯಥಾಹ 'ಪರಾಽಸ್ಯ​ ಶಕ್ತಿರ್ವಿವಿಧೈವ ಶೂಯತೇ ಸ್ವಾಭಾವಿಕೀ ಜ್ಞಾನಬಲಕ್ರಿಯಾ ಚ' (ಶ್ವೇ.ಉ. ೬-೮) 'ಯಃ ಸರ್ವಜ್ಞಃ ಸರ್ವವಿತ್ ಯಸ್ಯ ಜ್ಞಾನಮಯಂ ತಪಃ' (ಮುಂ.ಉ.೧-೧-೧೦) 'ಯಸ್ಯಾಽವ್ಯಕ್ತಂ ಶರೀರಂ ಯಸ್ಯಾಕ್ಷರಂ ಶರೀರಂ …… ಯಸ್ಯ ಮೃತ್ಯುಶ್ಯರೀರಮ್...ಏಷ ಸರ್ವಭೂತಾನ್ತರಾತ್ಮಾ (ಸು.ಉ. ೭) ಇತಿ।ತದೇತತ್, 'ನ ವಿಲಕ್ಷಣತ್ವಾತ್‌' (ಬ್ರ.ಸೂ.೨-೧-೪) ಇತ್ಯಾದಿಷು ಪ್ರತಿಪಾದಯಿಷ್ಯ​ತೇ। ಅತ್ರ, 'ಸೃಷ್ಟಿವಾಕ್ಯಾನಿ ನ ಪ್ರಧಾನಪ್ರತಿಪಾದನಯೋಗ್ಯಾನಿ' ಇತ್ಯುಚ್ಯತೇ। ವಸ್ತುವಿರೋಧಸ್ತು ತತ್ರೈವ ಪರಿಹರಿಷ್ಯತೇ।\n\nಯತ್ತೂಕ್ತಮ್ - ಪ್ರತಿಜ್ಞಾ - ದೃಷ್ಟಾನ್ತ​ಯೋಗಾತ್ ಅನುಮಾನರೂಪಮೇವ ಇದಂ ವಾಕ್ಕಮಿತಿ, ತದಸತ್ ಹೇತ್ವನುಪಾದನಾತ್, 'ಯೇನಾಽಶ್ರುತಂ ಶ್ರುತಮ್' (ಛಾಂ.ಉ.೬-೧-೩) ಇತಿ, ಏಕವಿಜ್ಞಾನೇನ ಸರ್ವವಿಜ್ಞಾನೇ ಪ್ರತಿಪಿಪಾದಯಿಷಿತೇ, ಸರ್ವಾತ್ಮನಾ ತದಸಂಭವಂ ಮನ್ವಾನಸ್ಯ ತತ್ಸ೦ಭವಮಾತ್ರ- ಪ್ರದರ್ಶನಾಯ ಹಿ, ದೃಷ್ಟಾನ್ತೋಪಾದಾನಮ್। ಈಕ್ಷತ್ಯಾದಿಶ್ರವಣಾದೇವ ಹಿ, ಅನುಮಾನಗನ್ಧಾಭಾವಃ ಅವಗತಃ||",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 5. Īkshaternāśabdam",
      text: "yato vā imāni' ityādijagatkāraṇavādivākyapratipādyaṃ sarvajñaṃ sarvaśaktisamastaheyapratyanīkakalyāṇaguṇaikatānaṃ brahma jijñāsyamityuktam . idānīṃ jagatkāraṇavādivākyānāmānumānikapradhānādipratipādanārnahatocyate- īkṣaternāśabdamityādinā\n\nidamāmnāyate chāndogye- 'sadeva somyedamagra āsīdekamevādvitīyam . tadaikṣata bahu syāṃ prajāyeyeti tattejo'sṛjata' ityādi . tatra sandehaḥ, kiṃ sacchabdavācyaṃ jagatkāraṇaṃ paroktamānumānikaṃ pradhānam ? utoktalakṣaṇaṃ brahma ? iti . kiṃ prāptam ? pradhānamiti . kutaḥ ? 'sadeva somyedamagra āsīdekamevādvitīyam' itīdaṃśabdavācyasya cetanabhogyabhūtasya sattvarajastamomayasya viyadādinānārūpavikārāvasthasya vastunaḥ kāraṇāvasthāṃ vadati, kāraṇabhūtadravyasyāvasthāntarāpattireva hi kāryatā, ato yaddravyaṃ yatsvabhāvaṃ ca kāryāvastham; tatsvabhāvaṃ tadeva dravyaṃ kāraṇāvastham . sattvādimayaṃ ca kāryamiti guṇasāmyāvasthaṃ pradhānameva hi kāraṇam . tadevopasaṃhṛtasakalaviśeṣaṃ sanmātramiti 'sadeva somyedamagra āsīdekamevādvitīyam' ityabhidhīyate . tata eva ca kāyarkāraṇayorananyatvam, tathā satyevaikavijñānena sarvavijñānapratijñopapattiḥ . anyathā 'yathā somyaikena mṛtpiṇḍena' ityādimṛtpiṇḍatatkāryadṛṣṭāntadārṣṭāntikayorvairūpyaṃ ceti jagatkāraṇavādivākyena maharṣiṇā kapilenoktaṃ pradhānameva pratipādyate . pratijñādṛṣṭāntarūpeṇānumānaveṣameva cedaṃ vākyamiti sacchabdavācyamānumānikameva-ityevaṃprāpte'bhidhīyate- īkṣaternāśabdamiti . yasmin śabda eva pramāṇaṃ na bhavati tadaśabdam . ānumānikam,pradhānamityarthaḥ . na tajjagatkāraṇavādivākyapratipādyam . kutaḥ ? īkṣateḥ sacchabdavācyasambandhivyāpāraviśeṣābhidhāyina īkṣaterdhātoḥ śravaṇāt . 'tadaikṣata bahu syāṃ prajāyeya' iti īkṣaṇakriyāyogaścācetane pradhāne na sambhavati. ataḥ īdṛśekṣaṇakṣamaścetanaviśeṣassarvajñaḥ sarvaśaktiḥ puruṣottamaḥ sacchabdābidheyaḥ . tathā ca sarveṣveva sṛṣṭiprakaraṇeṣvīkṣāpūrvikaiva sṛṣṭiḥ pratīyate 'sa īkṣata lokānnu sṛjā iti sa imāṃllokānasṛjata' 'sa īkṣāñcakre sa prāṇamasṛjata' ityādiṣu . nanu ca kāryānuguṇenaiva kāraṇena bhavitavyam . satyam, sarvakāryānuguṇa eva sarvajñaḥ sarvaśaktiḥ satyasaṅkalpaḥ puruṣottamaḥ sūkṣmacidacidvastuśarīrakaḥ . yathāha 'parā'sya śaktirvividhaiva śrūyate svābhāvikī jñānabalakriyā ca' 'yaḥ sarvajñaḥ sarvavidyasya jñānamayaṃ tapaḥ' 'yasyāvyaktaṃ śarīraṃ yasyākṣaraṃ śarīraṃ yasya mṛtyuḥ śarīram eṣa sarvabhūtāntarātmā' iti . tadetat 'na vilakṣaṇatvāt' ityādiṣu pratipādayiṣyate . atra sṛṣṭivākyāni na pradhānapratipādanayogyānītyucyate . vastuvirodhastu tatraiva parihariṣyate . yattūktampratijñādṛṣṭāntayogādanumānarūpamevedaṃ vākyamiti . tadasat, hetvanupādanāt . 'yenāśrutaṃ śrutam' ityekavijñānena sarvavijñāne pratipipādayiṣite sarvātmanā tadasambhavaṃ manvānasya tatsambhavamātrapradarśanāya hi dṛṣṭāntopādānam . īkṣatyādiśravaṇādeva hyanumānagandhābhāvo'vagataḥ .",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 5,
  },
  {
    kannada: {
      preSutra:
        "ಅಥ ಸ್ಯಾತ್ - ನ ಚೇತನಗತಂ ಮುಖ್ಯಮ್ ಈಕ್ಷಣಮ್ ಇಹೋಚ್ಯತೇ, ಅಪಿ ತು ಪ್ರಧಾನಗತಂ ಗೌಣಮೀಕ್ಷಣಮ್; 'ತತ್ತೇಜ ಐಕ್ಷತ' (ಛಾಂ.ಉ.೬-೨-೩) 'ತಾ ಆಪ ಐಕ್ಷನ್ತ' (ಛಾಂ.ಉ.೬-೨-೪) ಇತಿ ಗೌಣೇಕ್ಷಣಸಾಹಚರ್ಯಾತ್ । ಭವತಿ ಚ ಅಚೇತನೇಷ್ವಪಿ ಚೇತನಧರ್ಮೋಪಚಾರಃ; ಯಥಾ - 'ವೃಷ್ಟಿಪ್ರತೀಕ್ಷಾಃ ಶಾಲಯಃ' ವರ್ಷೇಣ ಬೀಜಂ ಪ್ರತಿಸಂಜಹರ್ಷ (ವಾ.ರಾ.ಸು.ಕಾ.೨೬-೬) ಇತಿ। 'ಅತಃ ಗೌಣಮೀಕ್ಷಣಮ್' ಇತಿ ಇಮಾಮಾಶಂಕಾಮ್ ಅನುಭಾವ್ಯ ಪರಿಹರತಿ ।",
      sutra: "ಗೌಣಶ್ಚೇನ್ನಾತ್ಮಶಬ್ದಾತ್ || ೧-೧-೬ ||",
      text: "ಯದುಕ್ತಮ್ - ಗೌಣೇಕ್ಷಣಸಾಹಚರ್ಯಾತ್, ಸತೋSಪಿ ಈಕ್ಷಣವ್ಯಪದೇಶಃ ಸರ್ಗನಿಯತ ಪೂರ್ವಾವಸ್ಥಾಭಿಪ್ರಾಯೋ ಗೌಣಃ – ಇತಿ | ತನ್ನ 'ಏತದಾತ್ಮಮಿದಂ ಸರ್ವಮ್ | ತತ್ಸತ್ಯಂ, ಸ ಆತ್ಮಾ' (ಛಾಂ.ಉ. ೬-೮-೭) ಇತಿ, ಸಚ್ಛಪ್ರತಿಪಾದಿತಸ್ಯ 'ಆತ್ಮ' ಶಬ್ಧೇನ ವ್ಯಪದೇಶಾತ್ ||\n\n ಏತದುಕ್ತಂ ಭವತಿ – 'ಏತದಾತ್ಮಮಿದಂ ಸರ್ವಂ ….. ಸ ಆತ್ಮಾ' ಇತಿ ಚೇತನಾಚೇತನಪ್ರಪಂಚೋದ್ದೇಶೇನ ಸತಃ ಆತ್ಮತ್ಯೋಪದೇಶೋಽಯಮ್, ನ ಅಚೇತನೇ ಪ್ರಧಾನೇ ಸಙ್ಗಚ್ಛತೇ - ಇತಿ ।। ಅತಃ ತೇಜೋಬನ್ನಾನಾಮಪಿ ಪರಮಾತ್ಯೈವ ಆತ್ಮೇತಿ, ತೇಜಃಪ್ರಕೃತಯೋSಪಿ ಶಬ್ದಾಃ ಪರಮಾತ್ಮನ ಏವ ವಾಚಕಾಃ । ತಥಾ ಹಿ – 'ಹನ್ತಾಹಮಿಮಾಸ್ತಿಸ್ರೋ ದೇವತಾ ಅನೇನ ಜೀವೇನಾತ್ಮನಾನುಪ್ರವಿಶ್ಯನಾಮರೂಪೇ ವ್ಯಾಕರವಾಣಿ' (ಛಾಂ.ಉ.೬-೩-೨) ಇತಿ ಪರಮಾತ್ಮಾನುಪ್ರವೇಶಾದೇವ ತೇಜಃಪ್ರಭೃತೀನಾಂ ವಸ್ತುತ್ವಂ ತತ್ತನ್ನಾಮಭಾಕ್ತ್ವಂ ಚೇತಿ, 'ತತ್ತೇಜ ಐಕ್ಷತ' (ಛಾಂ.ಉ.೬-೨-೪) 'ತಾ ಆಪ ಐಕ್ಷನ್ತ' (ಛಾಂ.ಉ.೬-೨-೪) ಇತ್ಯಪಿ, ಮುಖ್ಯ ಏವ ಈಕ್ಷಣವ್ಯಪದೇಶಃ। ಅತಃ ಸಾಹಚರ್ಯಾದಪಿ, 'ತದೈಕ್ಷತ' (ಛಾಂ.ಉ.೬-೨-೩) ಇತ್ಯತ್ರ ಗೌಣತ್ವಾಶಂಕಾ ದೂರೋತ್ಸಾರಿತಾ - ಇತಿ ಸೂತ್ರಾಭಿಪ್ರಾಯಃ ||",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 6. Gauṇaśchenātmashabdāt",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 6,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಂ ಸಚ್ಛಬ್ದ ಪ್ರತಿಪಾದ್ಯಮ್ -",
      sutra: "ತನ್ನಿಷ್ಠಸ್ಯ ಮೋಕ್ಷೋಪದೇಶಾತ್ || ೧-೧-೭ ||",
      text: "ಮುಮುಕ್ಷೋಃ ಶ್ವೇತಕೇತೋಃ, 'ತತ್ ತ್ವಮಸಿ' (ಛಾಂ.ಉ.೬-೮-೭) ಇತಿ ಸದಾತ್ಮಕತ್ವಾನುಸಂಧಾನಮ್ ಉಪದಿಶ್ಯ, ತನ್ನಿಷ್ಠಸ್ಯ 'ತಸ್ಯ ತಾವದೇವ ಚಿರಂ, ಯಾವನ್ನ ವಿಮೋಕ್ಷೆ, ಅಥ ಸಂಪತ್ಸ್ಯೇ’ (ಛಾಂ.ಉ.೬-೧೪-೨) ಇತಿ 'ಶರೀರಪಾತಮಾತ್ರಾನ್ತರಾಯಃ ಬ್ರಹ್ಮಸಂಪತ್ತಿಲಕ್ಷಣೋ ಮೋಕ್ಷಃ' ಇತ್ಯುಪದಿಶತಿ । ಯದಿ ಚ ಪ್ರಧಾನಮ್ ಅಚೇತನಂ ಕಾರಣಮುಪದಿಶ್ಯೇತ; ತದಾ ತದಾತ್ಮಕತ್ವಾನುಸಂಧಾನಸ್ಯ ಮೋಕ್ಷಸಾಧನತ್ವೋಪದೇಶಃ ನೋಪಪದ್ಯತೇ । 'ಯಥಾಕ್ರತುರಸ್ಮಿಂಲ್ಲೋಕೇ ಪುರುಷೋ ಭವತಿ, ತಥೇತಃ ಪ್ರೇತ್ಯ ಭವತಿ' (ಛಾ೦.ಉ.೩-೧೪-೧) ಇತಿ, ತನ್ನಿಷ್ಠಸ್ಯ ಅಚೇತನಸಂಪತ್ತಿರೇವ ಸ್ಯಾತ್ | ನ ಚ, ಮಾತಾಪಿತೃ- ಸಹಸ್ರೇಭ್ಯೋSಪಿ ವತ್ಸಲತರಂ ಶಾಸ್ತ್ರಮ್, ಏವಂವಿಧತಾಪತ್ರಯಾಭಿಹತಿಹೇತುಭೂತಾಮ್ ಅಚಿತ್ಸಂಪತ್ತಿಮ್ ಉಪದಿಶತಿ | ಪ್ರಧಾನಕಾರಣವಾದಿನೋsಪಿ ಹಿ ಪ್ರಧಾನನಿಷ್ಠಸ್ಯ ಮೋಕ್ಷಂ ನಾಭ್ಯುಪಗಚ್ಛನ್ತಿ ।।",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 7. Tannishṭhasya mokshopadeśāt.",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 7,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಮ್ -",
      sutra: "ಹೇಯತ್ವಾವಚನಾಚ್ಚ || ೧-೧-೮ ||",
      text: "ಯದಿ ಪ್ರಧಾನಮೇವ ಕಾರಣಂ ಸಚ್ಛಬ್ದಾಭಿಹಿತಂ ಭವೇತ್; ತದಾ ಮುಮುಕ್ಷೋ ಶ್ವೇತಕೇತೋಃ ತದಾತ್ಮಕತ್ವಮ್, ಮೋಕ್ಷವಿರೋಧಿತ್ವಾತ್ ಹೇಯತ್ತ್ವೇನೈವ ಉಪದೇಶಂ ಸ್ಮಾತ್ | ನ ಚ ತತ್ ಕ್ರಿಯತೇ, ಪ್ರತ್ಯುತ ಉಪಾದೇಯತ್ವೇನೈವ, 'ತತ್ತ್ವಮಸಿ' (ಛಾಂ.ಉ ೬-೮-೭) 'ತಸ್ಯ ತಾವದೇವ ಚಿರಮ್' (ಛಾಂ.ಉ.೬-೧೪-೨) ಇತ್ಯುಪದಿಶ್ಯತೇ ।।",
    },
    roman: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 8,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಮ್ -",
      sutra: "ಪ್ರತಿಜ್ಞಾವಿರೋಧಾತ್ || ೧-೧-೯ ||",
      text: "ಪ್ರಧಾನಕಾರಣತ್ವೇ, ಪ್ರತಿಜ್ಞಾವಿರೋಧಶ್ಚ ಭವತಿ । ವಾಕ್ಯೋಪಕ್ರಮೇ ಹಿ ಏಕವಿಜ್ಞಾನೇನ ಸರ್ವವಿಜ್ಞಾನಂ ಪ್ರತಿಜ್ಞಾತಮ್ । ತಚ್ಚ ಕಾರ್ಯ-ಕಾರಣಯೋಃ 'ಅನನ್ಯತ್ವೇನ, ಕಾರಣಭೂತಸದ್ವಿಜ್ಞಾನಾತ್ ತತ್ಕಾರ್ಯಭೂತ ಚೇತನಾಚೇತನಪ್ರಪಂಚಸ್ಯ ಜ್ಞಾತತಯೈವ, ಉಪಪಾದನೀಯಮ್ | ತತ್ತು, ಪ್ರಧಾನಕಾರಣತ್ವೇ ಚೇತನವರ್ಗಸ್ಯ ಪ್ರಧಾನಕಾರ್ಯತ್ವಾಭಾವಾತ್, ಪ್ರಧಾನವಿಜ್ಞಾನೇನ ಚೇತನವರ್ಗವಿಜ್ಞಾನಾಸಿದ್ದೇಃ ವಿರುದ್ಧ್ಯತೇ ।।\"",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 9. Pratijñāvirodhāt.",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 9,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಮ್",
      sutra: "ಸ್ವಾಪ್ಯಯಾತ್‌ || ೧-೧-೧೦ ||",
      text: "ತದೇವ ಸಚ್ಚಬ್ದವಾಚ್ಯಂ ಪ್ರಕೃತ್ಯ ಆಹ - 'ಸ್ವಪ್ನಾನ್ತಂ ಮೇ ಸೋಮ್ಯ ವಿಜಾನೀಹೀತಿ । ಯತ್ರೈತತ್ಪುರುಷಃ ಸ್ವಪಿತಿ ನಾಮ, ಸತಾ ಸೋಮ್ಯ ತದಾ ಸಂಪನ್ನೋ ಭವತಿ | ಸ್ವಮಪೀತೋ ಭವತಿ |ತಸ್ಮಾದೇನಂ ಸ್ವಪಿತೀತ್ಯಚಕ್ಷತೇ, 'ಸ್ವಂ ಹ್ಯಪೀತೋ ಭವತಿ' (ಛಾಂ.ಉ.೬೮-೧) ಇತಿ, ಸುಷುಪ್ತಂ ಜೀವಂ ಸತಾ ಸಮ್ಪನ್ನಮ್, 'ಸ್ವಮಪೀತಃ - ಸ್ವಸ್ಮಿನ್ ಪ್ರಲೀನಃ' ಇತಿ ವ್ಯಪದಿಶತಿ | ಪ್ರಲಯಶ್ಚ ಸ್ವಕಾರಣೇ ಲಯಃ | ನ ಚ ಅಚೇತನಂ ಪ್ರಧಾನಂ, ಚೇತನಸ್ಯ ಜೀವಸ್ಯ ಕಾರಣಂ ಭವಿತುಮರ್ಹತಿ ॥'ಸ್ವಮಪೀತೋ ಭವತಿ' - ಆತ್ಮಾನಮೇವ, ಜೀವಃ ಅಪೀತೋ ಭವತೀತ್ಯರ್ಥಃ | ಚಿದ್ವಸ್ತುಶರೀರಕಂ ತದಾತ್ಮಭೂತಂ ಬ್ರಹ್ಯೈವ ಜೀವಶಬ್ಧೇನ ಅಭಿಧೀಯತೇ ಇತಿ, ನಾಮರೂಪವ್ಯಾಕರಣಶ್ರುತ್ಯಾ ಉಕ್ತಮ್ | ತತ್ ಜೀವಶಬ್ದಾಭಿಧೇಯಂ ಬ್ರಹ್ಮ, ಸುಷುಪ್ತಿ ಕಾಲೇSಪಿ ಪ್ರಲಯಕಾಲ ಇವ ನಾಮರೂಪಪರಿಷ್ವಙ್ಗಾಭಾವಾತ್ ಕೇವಲ ಸಚ್ಛಬ್ಧಾಭಿಧೇಯಮಿತಿ, 'ಸತಾ ಸೋಮ್ಯ ತದಾ ಸಮ್ಪನ್ನೋ ಭವತಿ, ಸ್ವಮಪೀತೋ ಭವತಿ' (ಛಾಂ.ಉ.೬-೮-೧) ಇತ್ಯುಚ್ಯತೇ । ತಥಾ ಸಮಾನಪ್ರಕರಣೇ, ನಾಮ-ರೂಪಪರಿಷ್ವಂಗಾಭಾವೇನ ಪ್ರಾಜ್ಞನೈವ ಪರಿಷ್ವಙ್ಗಾತ್, 'ಪ್ರಾಜ್ಞೇನಾತ್ಮನಾ ಸಂಪರಿಷ್ವಕ್ತೋ ನ ಬಾಹ್ಯಂ ಕಿಞ್ಚನ ವೇದ, ನಾನ್ತರಮ್' (ಬೃ.ಉ.೬-೩-೨೧) ಇತ್ಯುಚ್ಯತೇ ।।ಆಮೋಕ್ಷಾತ್ ಜೀವಸ್ಯ ನಾಮರೂಪಪರಿಷ್ವಙ್ಗಾದೇವ ಹಿ ಸ್ವವ್ಯತಿರಿಕ್ತವಿಷಯಜ್ಞಾನೋದಯ: ಸುಷುಪ್ತಿಕಾಲೇ ಹಿ ನಾಮರೂಪೇ ವಿಹಾಯ ಸತಾ ಸಂಪರಿಷ್ವಕ್ತಃ, ಪುನರಪಿ ಜಾಗರದಶಾಯಾಂ ನಾಮ- ರೂಪೇ ಪರಿಷ್ವಜ್ಯ, ತತ್ತನ್ನಾಮರೂಪೋ ಭವತೀತಿ, ಶ್ರುತ್ಯಂತರೇ ಸ್ಪಷ್ಟಮಭಿಧೀಯತೇ – 'ಯದಾ ಸುಪ್ತಃ ಸ್ವಪ್ನಂ ನ ಕಥಞ್ಚನ ಪಶ್ಯತಿ, ಅರ್ಥಾಸ್ಮಿನ್ ಪ್ರಾಣ ಏವೈಕಧಾ ಭವತಿ' (ಕೌಷೀ.ಉ.೪-೩೯) 'ಏತಸ್ಮಾದಾತ್ಮನಃ ಪ್ರಾಣಾ ಯಥಾಯತನಂ ವಿಪ್ರತಿಷ್ಠನ್ತೇ' (ಕೌಪೀ.ಉ.೪-೪೦) ತಥಾ - 'ತ ಇಹ ವ್ಯಾಘ್ರೋ ವಾ ಸಿಂಹೋ ವಾ ವೃಕೋ ವಾ ವರಾಹೋ ವಾ ದಂಶೋ ವಾ ಮಶಕೋ ವಾ ಯದ್ಭದ್ಭವನ್ತಿ ತದಾಭವನ್ತಿ' (ಛಾಂ.ಉ.೬-೯-೩) ಇತಿ ।।'ತಥಾ ಸುಷುಪ್ತಂ ಜೀವಮ್ - 'ಪ್ರಾಜ್ಞೇನಾಽಽತ್ಮನಾ ಸಮ್ಪರಿಷ್ವಕ್ತಃ’ (ಬೃ.ಉ. ೬-೩-೨೧) ಇತಿ ಚ ವದತಿ । ತಸ್ಮಾತ್, ಸಚ್ಛಬ್ದವಾಚ್ಯಃ ಪರಂ ಬ್ರಹ್ಮ, ಸರ್ವಜ್ಞಃ ಪರಮೇಶ್ವರಃ ಪುರುಷೋತ್ತಮ ಏವ । ತದಾಹವೃತ್ತಿಕಾರಃ - 'ಸತಾ ಸೋಮ್ಯ ತದಾ ಸಮ್ಪನ್ನೋ ಭವತೀತಿ ಸಂಪತ್ಯಸಂಪತ್ತಿಭ್ಯಾಮ್ ಏತದಧ್ಯವಸೀಯತೇ । 'ಪ್ರಾಜ್ಞೇನಾಽಽತ್ಮನಾ ಸಮ್ಪರಿಷ್ವಕ್ತಃ’ ಇತಿ ಚಾಹ' (ಬೋ. ವೃ.) ಇತಿ ।।",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 10. Svāpyayāt.\r",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 10,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಮ್ -",
      sutra: "ಗತಿಸಾಮಾನ್ಯಾತ್‌ || ೧-೧-೧೧ ||",
      text: "ಆತ್ಮಾ ವಾ ಇದಮೇಕ ಏವಾಗ್ರ ಆಸೀತ್ ನಾನ್ಯತ್ ಕಿಞ್ಚನ ಮಿಷತ್ | ಸ ಈಕ್ಷತ ಲೋಕಾನ್ನು ಸೃಜಾ ಇತಿ' | (ಐತ.ಉ.೧-೧) 'ಸ ಇಮಾಂಲ್ಲೋಕಾನಸೃಜತ' (ಐತ.ಉ.೧-೨) 'ಸಂಭೂತಃ ಆತ್ಮನ ಆಕಾಶಃ ಸಂಭೂತಃ | ಆಕಾಶಾದ್ವಾಯುಃ । ವಾಯೋರಗ್ನಿ: ಅಸ್ಯ ಅಗ್ನೇರಾಪಃ | ಅದ್ಭ್ಯಃ ಪೃಥಿವೀ | (ತೈ.ಉ.ಆನ೧-೨) 'ಅಸ್ಯ ಮಹತೋ ಭೂತಸ್ಯ ನಿಃಶ್ವಸಿತಮೇತತ್, ಯತ್ ಋಗ್ವೇದಃ' (ಸುಬಾ.ಉ.೨) ಇತ್ಯಾದಿಸೃಷ್ಟಿವಾಕ್ಯಾನಾಂ ಯಾ ಗತಿಃ – ಪ್ರವೃತ್ತಿಃ, ತತ್ಸಾಮಾನ್ಯಾತ್ - ತತ್ಸಮಾನಾರ್ಥತ್ವಾದಸ್ಯ | ತೇಷು ಚ ಸರ್ವೇಷು, ಸರ್ವೇಶ್ವರಃ ಕಾರಣಮವಗಮ್ಯತೇ | ತಸ್ಮಾತ್ ಅತ್ರಾಪಿ ಸರ್ವೇಶ್ವರ ಏವ ಕಾರಣಮಿತಿ ನಿಶ್ಚೀಯತೇ ||",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 11. Gatisāmanyāt.",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 11,
  },
  {
    kannada: {
      preSutra: "ಇತಶ್ಚ, ನ ಪ್ರಧಾನಮ್ -",
      sutra: "ಶ್ರುತತ್ವಾಚ್ಚ || ೧-೧-೧೨ ||",
      text: "ಶ್ರುತಮೇವ ಹಿ ಅಸ್ಯಾಮ್ ಉಪನಿಷದಿ-ಅಸ್ಯ ಸಚ್ಛಬ್ದವಾಚ್ಯಸ್ಯ, ಆತ್ಮತ್ವೇನ ನಾಮ- ರೂಪಯೋರ್ವ್ಯಾಕರ್ತೃತ್ವಂ, ಸರ್ವಜ್ಞತ್ವಂ, ಸರ್ವಶಕ್ತಿತ್ವಂ, ಸರ್ವಾಧಾರತ್ವಮ್, ಅಪಹತಪಾಪ್ಮತ್ವಾದಿಕಂ, ಸತ್ಯಕಾಮತ್ವಂ, ಸತ್ಯಸಙ್ಕಲ್ಪತ್ವಂ ಚ; 'ಅನೇನ ಜೀವೇನಾಽಽತ್ಮನಾಽನುಪ್ರವಿಶ್ಯ ನಾಮರೂಪೇ ವ್ಯಾಕರವಾಣಿ' (ಛಾಂ.ಉ.೬-೩-೨) 'ಸನ್ಮೂಲಾಃ ಸೋಮ್ಯೇಮಾಃ ಸರ್ವಾ: ಪ್ರಜಾಃ ಸದಾಯತನಾಃ ಸತ್ಪ್ರತಿಷ್ಠಾಃ, (ಛಾಂ.ಉ.೬-೮-೬) 'ಐತದಾತ್ಮ್ಯಮಿದಂ ಸರ್ವಂ ತತ್ಸತ್ಯಂ ಸ ಆತ್ಮಾ' (ಛಾಂ.ಉ.೬-೮-೭) 'ಯಚ್ಚಾಸ್ಯೇಹಾಽಸ್ತಿ ಯಚ್ಚ ನಾಽಸ್ತಿ, ಸರ್ವಮ್ ತದಸ್ಮಿನ್ ಸಮಾಹಿತಮ್' (ಛಾಂ.ಉ.೮-೧-೩) 'ಅಸ್ಮಿನ್ ಕಾಮಾಃ ಸಮಾಹಿತಾಃ' (ಛಾಂ.ಉ.೮-೧-೫) 'ಏಷ ಆತ್ಮಾಽಪಹತಪಾಪ್ಮಾ ವಿಜರೋ ವಿಮೃತ್ಯುರ್ವಿಶೋಕಃ ವಿಜಿಘತ್ಸೋsಪಿಪಾಸಃ ಸತ್ಯಕಾಮಃ ಸತ್ಯಸಂಕಲ್ಪಃ' (ಛಾಂ.ಉ.೮-೧೫) ಇತಿ ||\n\n ತಥಾ ಚ ಶ್ರುತ್ಯಂತರಾಣಿ - 'ನ ತಸ್ಯ ಕಶ್ಚಿತ್ ಪತಿರಸ್ತಿ ಲೋಕೇ ನ ಚೇಶಿತಾ ನೈವ ಚ ತಸ್ಯ ಲಿಙ್ಗಮ್ । ಸ ಕಾರಣಂ ಕರಣಾಧಿಪಾಧಿಪೋ ನ ಚಾಽಸ್ಯ ಕಶ್ಚಿಜ್ಜನಿತಾ ನ ಚಾಽಧಿಪಃ' ॥ (ಶ್ವೇ.ಉ.೬-೯) 'ಸರ್ವಾಣಿ ರೂಪಾಣಿ ವಿಚಿತ್ರ ಧೀರೋ ನಾಮಾನಿ ಕೃತ್ವಾsಭಿವದನ್ ಯದಾssಸ್ತೇ' (ತೈ.ಆರ.ಪು.೩-೧೨-೧೬) 'ಅನ್ತಃಪ್ರವಿಷ್ಟಃ ಶಾಸ್ತಾ ಜನಾನಾಂ ಸರ್ವಾತ್ಮಾ' (ತೈ.ಆರ.೩-೧೧-೩) 'ವಿಶ್ವಾತ್ಮಾನಂ ಪರಾಯಣಮ್' (ತೈ.ನಾ.ಉ.೧೧-೩) 'ಪತಿಂ ವಿಶ್ವಸ್ಯಾತ್ವೇಶ್ವರಮ್' (ತೈ.ನಾ.ಉ.೧೧-೩) 'ಯಚ್ಚ ಕಿಞ್ಚಿಜ್ಜಗತ್ಯಸ್ಮಿನ್ ದೃಶ್ಯತೇ ಶೂಯತೇSಪಿ ವಾ । ಅನ್ತರ್ಬಹಿಶ್ಚ ತತ್ಸರ್ವಂ ವ್ಯಾಪ್ಯ ನಾರಾಯಣಃ ಸ್ಥಿತಃ' ॥ (ತೈ.ನಾ.ಉ.೧೧-೫) 'ಏಷ ಸರ್ವಭೂತಾನ್ತರಾತ್ಮಾಪಹತಪಾಪ್ಮಾ ದಿವ್ಯೋ ದೇವ ಏಕೋ ನಾರಾಯಣಃ' (ಸುಬಾ.ಉ. ೭) ಇತ್ಯಾದೀನಿ ।। ತಸ್ಮಾತ್ - ಜಗತ್ಕಾರಣವಾದಿವಾಕ್ಯಂ ನ ಪ್ರಧಾನಾದಿಪ್ರತಿಪಾದನಯೋಗ್ಯಮ್ । ಅತಃ ಸರ್ವಜ್ಞಃ ಸರ್ವಶಕ್ತಿಃ ಸರ್ವೇಶ್ವರೇಶ್ವರಃ ನಿರಸ್ತನಿಖಿಲದೋಷಗನ್ಧಃ ಅನವಧಿಕಾತಿಶಯಾಸಂಖ್ಯೆಯಕಲ್ಯಾಣಗುಣಗಣೌಘ- ಮಹಾರ್ಣವಃ ಪುರುಷೋತ್ತಮಃ ನಾರಾಯಣ ಏವ, ನಿಖಿಲಜಗದೇಕಕಾರಣಂ ಜಿಜ್ಞಾಸ್ಯಂ ಬ್ರಹ್ಮ ಇತಿ ಸ್ಥಿತಮ್ ||ಆತ ವಿವ, ನಿರ್ವಿಶೇಷಚಿನ್ಮಾತ್ರಬ್ರಹ್ಮವಾದೋSಪಿ, ಸೂತ್ರಕಾರೇಣ, ಅಭಿಃ ಶ್ರುತಿಭಿಃ ನಿರಸ್ತೋ ವೇದಿತವ್ಯಃ: 'ಪಾರಮಾರ್ಥಿಕಮುಖೇಕ್ಷಣಾದಿಗುಣಯೋಗಿ ಜಿಜ್ಞಾಸ್ಯಂ ಬ್ರಹ್ಮ' ಇತಿ ಸ್ಥಾಪನಾತ್ । ನಿರ್ವಿಶೇಷವಾದೇ ಹಿ ಸಾಕ್ಷಿತ್ವಮಪಿ ಅಪಾರಮಾರ್ಥಿಕಮ್ । ವೇದಾಂತವೇದ್ಯಂ ಬ್ರಹ್ಮ ಜಿಜ್ಞಾಸ್ಯತಯಾ ಪ್ರತಿಜ್ಞಾತಮ್; ತಚ್ಚ ಚೇತನಮ್ ಇತಿ 'ಈಕ್ಷತೇರ್ನಾಶಬ್ದಮ್' ಇತ್ಯಾದಿಭಿಃ ಸೂತ್ರೈಃ ಪ್ರತಿಪಾದ್ಯತೇ । ಚೇತನತ್ವಂ ನಾಮ ಚೈತನ್ಯಗುಣಯಗ ಅತಃ ಈಕ್ಷಣಗುಣವಿರಹಿಣಃ ಪ್ರಧಾನತುಲ್ಯತ್ವಮೇವ ।। ಕಿಂಚ - ನಿರ್ವಿಶೇಷಪ್ರಕಾಶಮಾತ್ರಬ್ರಹ್ಮವಾದೇ, ತಸ್ಯ ಪ್ರಕಾಶತ್ವಮಸಿ ದುರುಪಪಾದಮ್ | ಪ್ರಕಾಶೋ ಹಿ ನಾಮ ಸ್ವಸ್ಯ ಪರಸ್ಯ ಚ ವ್ಯವಹಾರಯೋಗ್ಯತಾಮಾಪಾದಯನ್ ವಸ್ತು ವಿಶೇಷಃ | ನಿರ್ವಿಶೇಷಸ್ಯ ವಸ್ತುನಃ ತದುಭಯರೂಪತ್ವಾಭಾವಾತ್ ಘಟಾದಿವತ್ ಅಚಿತ್ತ್ವಮೇವ । ತದುಭಯರೂಪತ್ವಾಭಾವೇsಪಿ ತತ್ಕ್ಷಮತ್ವಮಸ್ತಿ - ಇತಿ ಚೇತ್, ತನ; ತತ್ಸಮತ್ವಂ ಹಿ ತತ್ಸಾಮರ್ಥ್ಯಮೇವ | ಸಾಮರ್ಥ್ಯಗುಣಯೋಗೇ ಹಿ ನಿರ್ವಿಶೇಷವಾದಃ ಪರಿತ್ಯಕ್ತಃ ಸ್ಯಾತ್ ।। ಅಥ - ಶ್ರುತಿಪ್ರಾಮಾಣ್ಯಾತ್ ಅಯಮೇಕೋ ವಿಶೇಷಃ ಅಭ್ಯುಪಗಮ್ಯತೇ - ಇತಿ ಚೇತ್, ಹನ್ತತರ್ಹಿ! ತತ ಏವ ಸರ್ವಜ್ಞತಾ, ಸರ್ವಶಕ್ತಿತ್ವಮ್, ಸರ್ವೇಶ್ವರೇಶ್ವರತ್ವಮ್, ಸರ್ವಕಲ್ಯಾಣಗುಣಾಕರತ್ವಮ್, ಸಕಲಹೇಯಪ್ರತ್ಯನೀಕತಾ ಇತ್ಯಾದಯಃ ಸರ್ವೇ ಅಭ್ಯುಪಗನ್ತವ್ಯಾಃ | ಶಕ್ತಿಮತ್ವಂ ಚ ಕಾರ್ಯ- ವಿಶೇಷಾನುಗುಣತ್ವಮ್ | ತಚ್ಚ ಕಾರ್ಯವಿಶೇಷೈಕನಿರೂಪಣೀಯಮ್ | ಕಾರ್ಯವಿಶೇಷಸ್ಯ ನಿಷ್ಪ್ರಮಾಣಕತ್ವೇ ತದೇಕನಿರೂಪಣೀಯಂ ಶಕ್ತಿಮತ್ವಮಪಿ ನಿಷ್ಟ್ರಮಾಣಕಂ ಸ್ಯಾತ್ ||ಕಿಞ್ಚ-ನಿರ್ವಿಶೇಷವಸ್ತುವಾದಿನಃ ವಸ್ತುತ್ವಮಪಿ ನಿಷ್ಪ್ರಮಾಣಮ್ । ಪ್ರತ್ಯಕ್ಷಾನುಮಾನಾಗಮ- ಸ್ವಾನುಭವಾಃ ಸವಿಶೇಷಗೋಚರಾಃ - ಇತಿ ಪೂರ್ವಮೇವೋಕ್ತಮ್ । ತಸ್ಮಾತ್ ವಿಚಿತ್ರಚೇತನಾಚೇತನಾತ್ಮಕ ಜಗದ್ರೂಪೇಣ ಬಹು ಸ್ಯಾಮ್ ಇತಿ ಈಕ್ಷಣಕ್ಷಮಃ, ಪುರುಷೋತ್ತಮ ಏವ ಜಿಜ್ಞಾಸ್ಯಃ - ಇತಿ ಸಿದ್ಧಮ್ ।।",
    },
    roman: {
      preSutra: "",
      sutra: "Sutra 12. Śrutvāchcha.",
      text: "",
    },
    telugu: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    tamil: {
      preSutra: "",
      sutra: "",
      text: "",
    },
    number: 12,
  },
]
